RT-Thread/rt-thread/bsp/imxrt/product/board/MCUX_Config/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define BOARD_INITPINS_IOMUXC_GPR_GPR42_GPIO_MUX3_GPIO_SEL_LOW_MASK 0x3FE0U /*!< GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */
#define BOARD_INITPINS_IOMUXC_GPR_GPR43_GPIO_MUX3_GPIO_SEL_HIGH_MASK 0x067FU /*!< GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

#if defined(BSP_USING_LPUART)
void board_lpuart_pin_init(void);
#endif /* BSP_USING_LPUART */

#if defined(BSP_USING_FLEXSPI)
void board_flexspi_pin_init(void);
#endif /* BSP_USING_FLEXSPI */

#if defined(BSP_USING_SPI)
void board_spi_pin_init(void);
#endif /* BSP_USING_SPI */

#if defined(BSP_USING_I2C)
void board_i2c_pin_init(void);
#endif /* BSP_USING_I2C */

#if defined(BSP_USING_SDIO)
void board_sdio_pin_init(void);
#endif /* BSP_USING_SDIO */

#if defined(BSP_USING_ETH)
void board_eth_pin_init(void);
#endif /* BSP_USING_ETH */

#if defined(BSP_USING_ESP32)
void board_esp32_pin_init(void);
#endif /* BSP_USING_ESP32 */

#if defined(BSP_USING_EFR32)
void board_efr32_pin_init(void);
#endif /* BSP_USING_EFR32 */

#if defined(BSP_USING_BUTTON)
void board_button_pin_init(void);
#endif /* BSP_USING_BUTTON */

#if defined(BSP_USING_ANTENNA_RF_SWITCH)
void board_antenna_rf_switch_pin_init(void);
#endif /* BSP_USING_ANTENNA_RF_SWITCH */

#if defined(BSP_USING_TPM)
void board_tpm_pin_init(void);
#endif /* BSP_USING_TPM */

#if defined(BSP_USING_WDT)
void board_wdt_pin_init(void);
#endif /* BSP_USING_WDT */

#if defined(BSP_USING_LED)
void board_led_pin_init(void);
#endif /* BSP_USING_LED */

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
